remotemcu/remcu-chip-sdks/stm32/stm32l0/Drivers/STM32L0xx_HAL_Driver/fun_implementation/stm32l0xx_ll_bus.h.c
/**
  * @brief  Enable APB1 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll APB1SMENR    TIM2SMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    TIM3SMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    TIM6SMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    TIM7SMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    LCDSMEN       LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    WWDGSMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    SPI2SMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    USART2SMEN    LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    LPUART1SMEN   LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    USART4SMEN    LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    USART5SMEN    LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    I2C1SMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    I2C2SMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    USBSMEN       LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    CRSSMEN       LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    PWRSMEN       LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    DACSMEN       LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    I2C3SMEN      LL_APB1_GRP1_EnableClockSleep\n
  *         APB1SMENR    LPTIM1SMEN    LL_APB1_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_LCD (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_APB1_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB1SMENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB1SMENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB1 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll APB1SMENR    TIM2SMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    TIM3SMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    TIM6SMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    TIM7SMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    LCDSMEN       LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    WWDGSMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    SPI2SMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    USART2SMEN    LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    LPUART1SMEN   LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    USART4SMEN    LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    USART5SMEN    LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    I2C1SMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    I2C2SMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    USBSMEN       LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    CRSSMEN       LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    PWRSMEN       LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    DACSMEN       LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    I2C3SMEN      LL_APB1_GRP1_DisableClockSleep\n
  *         APB1SMENR    LPTIM1SMEN    LL_APB1_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM2
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM3 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM6 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_TIM7 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_LCD (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_WWDG
  *         @arg @ref LL_APB1_GRP1_PERIPH_SPI2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART2
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPUART1
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART4 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USART5 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C1
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C2 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_USB (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_CRS (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_PWR
  *         @arg @ref LL_APB1_GRP1_PERIPH_DAC1 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_I2C3 (*)
  *         @arg @ref LL_APB1_GRP1_PERIPH_LPTIM1
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_APB1_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB1SMENR, Periphs);
}

/**
  * @}
  */

/** @defgroup BUS_LL_EF_APB2 APB2
  * @{
  */

/**
  * @brief  Enable APB2 peripherals clock.
  * @rmtoll APB2ENR      SYSCFGEN      LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      TIM21EN       LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      TIM22EN       LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      FWEN          LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      ADCEN         LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      SPI1EN        LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      USART1EN      LL_APB2_GRP1_EnableClock\n
  *         APB2ENR      DBGEN         LL_APB2_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM21
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM22  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_FW
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB2ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB2ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 peripheral clock is enabled or not
  * @rmtoll APB2ENR      SYSCFGEN      LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM21EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      TIM22EN       LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      FWEN          LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      ADCEN         LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      SPI1EN        LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      USART1EN      LL_APB2_GRP1_IsEnabledClock\n
  *         APB2ENR      DBGEN         LL_APB2_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM21
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM22  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_FW
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
*/
uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB2ENR, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 peripherals clock.
  * @rmtoll APB2ENR      SYSCFGEN      LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      TIM21EN       LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      TIM22EN       LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      FWEN          LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      ADCEN         LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      SPI1EN        LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      USART1EN      LL_APB2_GRP1_DisableClock\n
  *         APB2ENR      DBGEN         LL_APB2_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM21
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM22  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_FW
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_APB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2ENR, Periphs);
}

/**
  * @brief  Force APB2 peripherals reset.
  * @rmtoll APB2RSTR     SYSCFGRST     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR     TIM21RST      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR     TIM22RST      LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR     ADCRST        LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR     SPI1RST       LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR     USART1RST     LL_APB2_GRP1_ForceReset\n
  *         APB2RSTR     DBGRST        LL_APB2_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM21
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM22  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1 (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_APB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @brief  Release APB2 peripherals reset.
  * @rmtoll APB2RSTR     SYSCFGRST     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR     TIM21RST      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR     TIM22RST      LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR     ADCRST        LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR     SPI1RST       LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR     USART1RST     LL_APB2_GRP1_ReleaseReset\n
  *         APB2RSTR     DBGRST        LL_APB2_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM21
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM22  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_APB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @brief  Enable APB2 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll APB2SMENR    SYSCFGSMEN    LL_APB2_GRP1_EnableClockSleep\n
  *         APB2SMENR    TIM21SMEN     LL_APB2_GRP1_EnableClockSleep\n
  *         APB2SMENR    TIM22SMEN     LL_APB2_GRP1_EnableClockSleep\n
  *         APB2SMENR    ADCSMEN       LL_APB2_GRP1_EnableClockSleep\n
  *         APB2SMENR    SPI1SMEN      LL_APB2_GRP1_EnableClockSleep\n
  *         APB2SMENR    USART1SMEN    LL_APB2_GRP1_EnableClockSleep\n
  *         APB2SMENR    DBGSMEN       LL_APB2_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM21
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM22  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_APB2_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB2SMENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB2SMENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable APB2 peripherals clock during Low Power (Sleep) mode.
  * @rmtoll APB2SMENR    SYSCFGSMEN    LL_APB2_GRP1_DisableClockSleep\n
  *         APB2SMENR    TIM21SMEN     LL_APB2_GRP1_DisableClockSleep\n
  *         APB2SMENR    TIM22SMEN     LL_APB2_GRP1_DisableClockSleep\n
  *         APB2SMENR    ADCSMEN       LL_APB2_GRP1_DisableClockSleep\n
  *         APB2SMENR    SPI1SMEN      LL_APB2_GRP1_DisableClockSleep\n
  *         APB2SMENR    USART1SMEN    LL_APB2_GRP1_DisableClockSleep\n
  *         APB2SMENR    DBGSMEN       LL_APB2_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM21
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM22  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1  (*)
  *         @arg @ref LL_APB2_GRP1_PERIPH_DBGMCU
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_APB2_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2SMENR, Periphs);
}

/**
  * @}
  */
/** @defgroup BUS_LL_EF_IOP IOP
  * @{
  */

/**
  * @brief  Enable IOP peripherals clock.
  * @rmtoll IOPENR       GPIOAEN       LL_IOP_GRP1_EnableClock\n
  *         IOPENR       GPIOBEN       LL_IOP_GRP1_EnableClock\n
  *         IOPENR       GPIOCEN       LL_IOP_GRP1_EnableClock\n
  *         IOPENR       GPIODEN       LL_IOP_GRP1_EnableClock\n
  *         IOPENR       GPIOEEN       LL_IOP_GRP1_EnableClock\n
  *         IOPENR       GPIOHEN       LL_IOP_GRP1_EnableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOH (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_IOP_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->IOPENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->IOPENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if IOP peripheral clock is enabled or not
  * @rmtoll IOPENR       GPIOAEN       LL_IOP_GRP1_IsEnabledClock\n
  *         IOPENR       GPIOBEN       LL_IOP_GRP1_IsEnabledClock\n
  *         IOPENR       GPIOCEN       LL_IOP_GRP1_IsEnabledClock\n
  *         IOPENR       GPIODEN       LL_IOP_GRP1_IsEnabledClock\n
  *         IOPENR       GPIOEEN       LL_IOP_GRP1_IsEnabledClock\n
  *         IOPENR       GPIOHEN       LL_IOP_GRP1_IsEnabledClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOH (*)
  *
  *         (*) value not defined in all devices.
  * @retval State of Periphs (1 or 0).
*/
uint32_t LL_IOP_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->IOPENR, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable IOP peripherals clock.
  * @rmtoll IOPENR       GPIOAEN       LL_IOP_GRP1_DisableClock\n
  *         IOPENR       GPIOBEN       LL_IOP_GRP1_DisableClock\n
  *         IOPENR       GPIOCEN       LL_IOP_GRP1_DisableClock\n
  *         IOPENR       GPIODEN       LL_IOP_GRP1_DisableClock\n
  *         IOPENR       GPIOEEN       LL_IOP_GRP1_DisableClock\n
  *         IOPENR       GPIOHEN       LL_IOP_GRP1_DisableClock
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOH (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_IOP_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->IOPENR, Periphs);
}

/**
  * @brief  Disable IOP peripherals clock.
  * @rmtoll IOPRSTR      GPIOASMEN     LL_IOP_GRP1_ForceReset\n
  *         IOPRSTR      GPIOBSMEN     LL_IOP_GRP1_ForceReset\n
  *         IOPRSTR      GPIOCSMEN     LL_IOP_GRP1_ForceReset\n
  *         IOPRSTR      GPIODSMEN     LL_IOP_GRP1_ForceReset\n
  *         IOPRSTR      GPIOESMEN     LL_IOP_GRP1_ForceReset\n
  *         IOPRSTR      GPIOHSMEN     LL_IOP_GRP1_ForceReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_ALL
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOH (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_IOP_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->IOPRSTR, Periphs);
}

/**
  * @brief  Release IOP peripherals reset.
  * @rmtoll IOPRSTR      GPIOASMEN     LL_IOP_GRP1_ReleaseReset\n
  *         IOPRSTR      GPIOBSMEN     LL_IOP_GRP1_ReleaseReset\n
  *         IOPRSTR      GPIOCSMEN     LL_IOP_GRP1_ReleaseReset\n
  *         IOPRSTR      GPIODSMEN     LL_IOP_GRP1_ReleaseReset\n
  *         IOPRSTR      GPIOESMEN     LL_IOP_GRP1_ReleaseReset\n
  *         IOPRSTR      GPIOHSMEN     LL_IOP_GRP1_ReleaseReset
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_ALL
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOH (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_IOP_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->IOPRSTR, Periphs);
}

/**
  * @brief  Enable IOP peripherals clock during Low Power (Sleep) mode.
  * @rmtoll IOPSMENR     GPIOARST      LL_IOP_GRP1_EnableClockSleep\n
  *         IOPSMENR     GPIOBRST      LL_IOP_GRP1_EnableClockSleep\n
  *         IOPSMENR     GPIOCRST      LL_IOP_GRP1_EnableClockSleep\n
  *         IOPSMENR     GPIODRST      LL_IOP_GRP1_EnableClockSleep\n
  *         IOPSMENR     GPIOERST      LL_IOP_GRP1_EnableClockSleep\n
  *         IOPSMENR     GPIOHRST      LL_IOP_GRP1_EnableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOH (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_IOP_GRP1_EnableClockSleep(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->IOPSMENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->IOPSMENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Disable IOP peripherals clock during Low Power (Sleep) mode.
  * @rmtoll IOPSMENR     GPIOARST      LL_IOP_GRP1_DisableClockSleep\n
  *         IOPSMENR     GPIOBRST      LL_IOP_GRP1_DisableClockSleep\n
  *         IOPSMENR     GPIOCRST      LL_IOP_GRP1_DisableClockSleep\n
  *         IOPSMENR     GPIODRST      LL_IOP_GRP1_DisableClockSleep\n
  *         IOPSMENR     GPIOERST      LL_IOP_GRP1_DisableClockSleep\n
  *         IOPSMENR     GPIOHRST      LL_IOP_GRP1_DisableClockSleep
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOA
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOB
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOC
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOD (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOE (*)
  *         @arg @ref LL_IOP_GRP1_PERIPH_GPIOH (*)
  *
  *         (*) value not defined in all devices.
  * @retval None
*/
void LL_IOP_GRP1_DisableClockSleep(uint32_t Periphs)
{
  CLEAR_BIT(RCC->IOPSMENR, Periphs);
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __STM32L0xx_LL_BUS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

#include "remcu_exports_symbol_exit.h"